БИТУправление_медицинским_центром_демо/src/InformationRegisters/СитиЛаб_НастройкиВзаимодействия/СитиЛаб_НастройкиВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СитиЛаб_НастройкиВзаимодействия</name>
  <comment>Интеграция с лабораториями Ситилаб</comment>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоздаватьНовуюНоменклатуру</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаЗагрузкиНоменклатуры</name>
    <comment>Используется при синхронизации справочников</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>СпециализацияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </resources>
  <resources>
    <name>Лаборант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерДиапазонаНомеровЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерЭтикетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодЛПУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеОрганизацииВЭтикетке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРегистрационнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СхемаФормированияШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформироватьКлиентовОСтатусеЗаказаПоСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнформироватьКлиентовОСтатусеЗаказаПоEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколПередачиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СитиЛаб_НастройкиВзаимодействия/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтикеткаШирина = Лев(Запись.РазмерЭтикетки, 3);
	ЭтикеткаВысота = Прав(Запись.РазмерЭтикетки, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.РазмерЭтикетки = Формат(ЭтикеткаШирина,"ЧЦ=3; ЧН=Ноль; ЧВН=") + "x" + Формат(ЭтикеткаВысота,"ЧЦ=3; ЧН=Ноль; ЧВН=");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	СитиЛаб_ИнтеграцияСервер.ПервоначальнаяЗагрузкаПараметровЗабора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	
	Если Запись.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант") Тогда
		Запись.Прейскурант = ПредопределенноеЗначение("Справочник.Прейскуранты.ПустаяСсылка");
		ТекстСообщения = НСтр("ru='Нельзя выбирать основной прейскурант.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Запись.Прейскурант");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераПриИзменении(Элемент)
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запись.АдресСервера);
	
	Запись.АдресСервера = СтруктураURI.Хост;
	
	Если СтруктураURI.Порт <> Неопределено Тогда
		Запись.Порт = СтруктураURI.Порт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаФормированияШтрихкодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
